In [3]:
#sum of N natural numbers
sum=0
n=as.integer(readline("enter ur N for sum of N natural numbers:"))
for(i in seq(n))
    {sum=sum+i
     
    }
    print(sum)

enter ur N for sum of N natural numbers:4
[1] 10

In [5]:
#factorial of given number 3!=1*2*3
factorial=1
f=as.integer(readline("what is ur number for factorial"))

for(i in seq(f))
    {factorial=factorial*i
    }
print(factorial)

what is ur number for factorial4
[1] 24

In [2]:
#create elect code form get id name dept sub name ,if sub is empty enter data sci course (use if else)
elec=function(){
    c=(readline("what is ur course"))
    name=(readline("what is ur name"))
    dept=(readline("what is ur dept"))
    id=(readline("what is ur id"))
    
    if(dept=="")
    {dept="data sci"}
    
    
    print(c)
    print(name)
    print(dept)
    print(id)
        
}
elec()

what is ur courseai
what is ur namegaja
what is ur dept
what is ur id45
[1] "ai"
[1] "gaja"
[1] "data sci"
[1] "45"

In [3]:
library(stringr)

In [9]:
x=c(" 4456 2345 3997 4516 hi 12 abc my name is what my name is who my name is slim shady,number is 7639356573 im gaja@gmail.com")
str_extract_all(x,"\\d{4}\\s\\d{4}\\s\\d{4}\\s\\d{2}[d{2}[1-9]+")

[[1]]
character(0)

In [10]:
df=read.csv("employee.csv")

In [14]:
head(df,5)

  EMPLOYEE_ID FIRST_NAME LAST_NAME EMAIL    PHONE_NUMBER HIRE_DATE JOB_ID
1 198         Donald     OConnell  DOCONNEL 650.507.9833 21-Jun-07 SH_CLERK
2 199         Douglas    Grant     DGRANT   650.507.9844 13-Jan-08 SH_CLERK
3 200         Jennifer   Whalen    JWHALEN  515.123.4444 17-Sep-03 AD_ASST
4 201         Michael    Hartstein MHARTSTE 515.123.5555 17-Feb-04 MK_MAN
5 202         Pat        Fay       PFAY     603.123.6666 17-Aug-05 MK_REP
  SALARY MANAGER_ID DEPARTMENT_ID
1  2600  124        50
2  2600  124        50
3  4400  101        10
4 13000  100        20
5  6000  201        20

In [16]:
ncol(df)
nrow(df)

[1] 10

[1] 50

In [17]:
tail(df,4)

   EMPLOYEE_ID FIRST_NAME LAST_NAME EMAIL   PHONE_NUMBER HIRE_DATE JOB_ID
47 137         Renske     Ladwig    RLADWIG 650.121.1234 14-Jul-03 ST_CLERK
48 138         Stephen    Stiles    SSTILES 650.121.2034 26-Oct-05 ST_CLERK
49 139         John       Seo       JSEO    650.121.2019 12-Feb-06 ST_CLERK
50 140         Joshua     Patel     JPATEL  650.121.1834 06-Apr-06 ST_CLERK
   SALARY MANAGER_ID DEPARTMENT_ID
47 3600   123        50
48 3200   123        50
49 2700   123        50
50 2500   123        50

In [19]:
a=subset(df,SALARY==max(SALARY))
a

   EMPLOYEE_ID FIRST_NAME LAST_NAME EMAIL PHONE_NUMBER HIRE_DATE JOB_ID  SALARY
10 100         Steven     King      SKING 515.123.4567 17-Jun-03 AD_PRES 24000
   MANAGER_ID DEPARTMENT_ID
10  -         90

In [20]:
table(df$JOB_ID)

AC_ACCOUNT     AC_MGR    AD_ASST    AD_PRES      AD_VP FI_ACCOUNT     FI_MGR
         1          1          1          1          2          5          1
    HR_REP    IT_PROG     MK_MAN     MK_REP     PR_REP   PU_CLERK     PU_MAN
         1          5          1          1          1          5          1
  SH_CLERK   ST_CLERK     ST_MAN
         2         16          5

In [22]:
a=subset(df,JOB_ID=="SH_CLERK")
a

  EMPLOYEE_ID FIRST_NAME LAST_NAME EMAIL    PHONE_NUMBER HIRE_DATE JOB_ID
1 198         Donald     OConnell  DOCONNEL 650.507.9833 21-Jun-07 SH_CLERK
2 199         Douglas    Grant     DGRANT   650.507.9844 13-Jan-08 SH_CLERK
  SALARY MANAGER_ID DEPARTMENT_ID
1 2600   124        50
2 2600   124        50

In [25]:
a=subset(df,SALARY>500 & JOB_ID=="SH_CLERK")
a

  EMPLOYEE_ID FIRST_NAME LAST_NAME EMAIL    PHONE_NUMBER HIRE_DATE JOB_ID
1 198         Donald     OConnell  DOCONNEL 650.507.9833 21-Jun-07 SH_CLERK
2 199         Douglas    Grant     DGRANT   650.507.9844 13-Jan-08 SH_CLERK
  SALARY MANAGER_ID DEPARTMENT_ID
1 2600   124        50
2 2600   124        50

In [29]:
install.packages("lubridate")

Warning message:
"unable to access index for repository https://cran.r-project.org/src/contrib:
  cannot open URL 'https://cran.r-project.org/src/contrib/PACKAGES'"Warning message:
"package 'lubridate' is not available (for R version 3.6.1)"Warning message:
"unable to access index for repository https://cran.r-project.org/bin/windows/contrib/3.6:
  cannot open URL 'https://cran.r-project.org/bin/windows/contrib/3.6/PACKAGES'"

### library("lubridate")